# ==================== Создание дата.фрейма ==================== #
df <- data.frame( "Фамилия" = c("Иванов", "Петровa", "Сидоровa", "Потерянная"), 
		"Возраст" = c( 21, 25, 22, NA),
		"Пол"     = c( "M", "Ж", "Ж", "Ж")
	    )
print(df) 


# ==================== Задание 5 ==================== #
print(df[2])
print(df[2,])
print(df$Возраст)
print(df[2:3])
print(df[2:3,])
print(df[3,2])

# ==================== Задание 6 ==================== #

df_clean <- na.omit(df)

print(df_clean)

# ==================== Задание 7 ==================== #

write.table(df_clean, file = "data1.txt", sep = "\t", row.names = FALSE)

# ==================== Задание 8 ==================== #

write.csv(df_clean, file = "data1.csv", row.names = FALSE)